5.VonKarmenVortexStreet/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.1.0                                  |
|   \\  /    A nd           | Web:      http://www.OpenFOAM.com               |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/

FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

//TO VISUALIZE THE DEFINED POINTS, TYPE 'paraFoam -block'//////////////////////////////


convertToMeters 1.0;

//dimensions (you will neeed to adjust these)
// in this specific file the things you can modify without changing anything else is 
// domain sizes, radial cell numbers and gradings

D                   1;           //cylinder diameter
L_before            #calc "4*$D";  //length before the cylinder (x-dir)
L_after             #calc "10*$D"; //length after the cylinder (x-dir)
Height              #calc "5*$D";  //height of the mesh        (y-dir)   

//////// domain parameters, CAN BE MODIFIED

Nr		100;									// radial number of meshes in the vicinity of cylinder
Nt		#calc "int($Nr*0.5)";				// tangential number of meshes near the cylinder
Nz		1;									// a test in z direction          
NtBack	#calc "int($Nt * 1.35)";			// finer resolution behind cylinder
NtFront	#calc "int($Nr * 0.3)";				// coarser resolution in front of the cylinder

rr		0.15;								// Radial domain expansion ratio
r1		0.4;								// left of circular domain expansion ratio
r2		5.0;								// above and below the circular domain expansion ratio
r3		6.0;								// right of circular domain expansion ratio



//////////////////////////////
//calculated DO NOT MODIFY
/////////////////////////////
sin45           #calc "sin(constant::mathematical::pi/4)";
cos45           #calc "cos(constant::mathematical::pi/4)";

R               #calc "0.5*$D";
negativeR       #neg $R;
bigR            #calc "4*$R";   //this controls the size of the 4 blocks nearest to the cylinder
negativeBigR	#neg $bigR;


//////////////////////////////
//coordinate definitions DO NOT MODIFY
/////////////////////////////
//all possible x-coordinates 
x0              #neg $L_before;
x1              #calc "-$sin45*$bigR";
x2              #calc "-$sin45*$R";
x3              #neg $x2;
x4              #calc " $sin45*$bigR";
x5              $L_after;

//all possible y-coordinates
y0              #neg $Height;
y1              #calc "-$cos45*$bigR";
y2              #calc "-$cos45*$R";
y3              #neg $y2;
y4              #calc " $cos45*$bigR";
y5              $Height;

//all possible z-coordinates
z0              #neg $R;
z1              $R;

////////////////////////////

vertices        
(

    //All required points are defined so DO NOT MODIFY
    
     //y0-points
    ($x0 $y0 $z0) //0
    ($x0 $y0 $z1) //1
    
    ($x1 $y0 $z0) //2
    ($x1 $y0 $z1) //3
   
    ($x4 $y0 $z0) //4
    ($x4 $y0 $z1) //5
    
    ($x5 $y0 $z0) //6
    ($x5 $y0 $z1) //7
    
    
    //y1-points
    ($x0 $y1 $z0) //8
    ($x0 $y1 $z1) //9
    
    ($x1 $y1 $z0) //10
    ($x1 $y1 $z1) //11
   
    ($x4 $y1 $z0) //12
    ($x4 $y1 $z1) //13
    
    ($x5 $y1 $z0) //14
    ($x5 $y1 $z1) //15

    //y2-points (cylinder lower half)
    ($x2 $y2 $z0) //16
    ($x2 $y2 $z1) //17
    
    ($x3 $y2 $z0) //18
    ($x3 $y2 $z1) //19
    
    //y3-points (cylinder upper half)
    ($x2 $y3 $z0) //20
    ($x2 $y3 $z1) //21
    
    ($x3 $y3 $z0) //22
    ($x3 $y3 $z1) //23
    
    
    
    //y4-points
    ($x0 $y4 $z0) //24
    ($x0 $y4 $z1) //25
    
    ($x1 $y4 $z0) //26
    ($x1 $y4 $z1) //27
   
    ($x4 $y4 $z0) //28
    ($x4 $y4 $z1) //29
    
    ($x5 $y4 $z0) //30
    ($x5 $y4 $z1) //31
    
    
    //y5-points
    ($x0 $y5 $z0) //32
    ($x0 $y5 $z1) //33
    
    ($x1 $y5 $z0) //34
    ($x1 $y5 $z1) //35
   
    ($x4 $y5 $z0) //36
    ($x4 $y5 $z1) //37
    
    ($x5 $y5 $z0) //38
    ($x5 $y5 $z1) //39

); 

///////////////////////////////////////////////
//////////// Radial and tangential domain parameters
///////////////////////////////////////////////
		
Lr		#calc "$bigR-$R";								// first domain length
rrT		#calc "1.0/$rr";
qr 		#calc "pow($rr, 1.0/($Nr - 1))";				// first domain geometric sequence common ratio
qrT		#calc "pow($rrT, 1.0/($Nr - 1))";
ar		#calc "$Lr*(1.0 - $qr)/(1.0 - pow($qr, $Nr))";
arT		#calc "$Lr*(1.0 - $qrT)/(1.0 - pow($qrT, $Nr))";

///////////////////////////////////////////////
//////////// left of the circular domain
///////////////////////////////////////////////
L1		#calc "$L_before-$bigR";					// the length of domain before the first

a1		#calc "($ar)/($r1)";						// first term of geometric sequence
q1		#calc "($L1-$a1)/($L1-$a1*$r1)";			// common ratio
N1		#calc "int(1.0 + log($r1)/log($q1) + 0.5)";	

///////////////////////////////////////////////
//////////// above the circular domain
///////////////////////////////////////////////
L2		#calc "$Height - $bigR";
a2		#calc "$arT * pow($qrT,$Nr-1)";				// first term of right geometric sequence
q2		#calc "($L2-$a2)/($L2-$a2*$r2)";			// right geometric common ratio
N2		#calc "int(1.0 + log($r2)/log($q2) + 0.5)";	

///////////////////////////////////////////////
//////////// right of the circular domain
///////////////////////////////////////////////
L3		#calc "$L_after - $bigR";

a3		#calc "$arT * pow($qrT,$Nr-1)";				// first term of right geometric sequence
q3		#calc "($L3-$a3)/($L3-$a3*$r3)";			// right geometric common ratio
N3		#calc "int(1.0 + log($r3)/log($q3) + 0.5)";

///////////////////////////////////////////////
//////////// below the circular domain: there is no need cause it is symmetrical
///////////////////////////////////////////////
r4		#calc "1.0 / $r2";
N4		$N2;

blocks          
(
	hex (10 16 20 26 11 17 21 27) 	($Nr $NtFront $Nz) simpleGrading ($rr 1 1)
	hex (20 22 28 26 21 23 29 27) 	($Nt $Nr $Nz) simpleGrading (1 $rrT 1)
	hex (18 12 28 22 19 13 29 23) 	($Nr $NtBack $Nz) simpleGrading ($rrT 1 1)
	hex (10 12 18 16 11 13 19 17) 	($Nt $Nr $Nz) simpleGrading (1 $rr 1)
  
	hex (8 10 26 24 9 11 27 25)		($N1 $NtFront $Nz) simpleGrading ($r1 1 1)
	hex (26 28 36 34 27 29 37 35)	($Nt $N2 $Nz) simpleGrading (1 $r2 1)
	hex (12 14 30 28 13 15 31 29)	($N3 $NtBack $Nz) simpleGrading ($r3 1 1)
	hex (2 4 12 10 3 5 13 11)		($Nt $N4 $Nz) simpleGrading (1 $r4 1)
  
	hex (24 26 34 32 25 27 35 33)	($N1 $N2 $Nz) simpleGrading ($r1 $r2 1)
	hex (28 30 38 36 29 31 39 37)	($N3 $N2 $Nz) simpleGrading ($r3 $r2 1)
	hex (4 6 14 12 5 7 15 13)		($N3 $N4 $Nz) simpleGrading ($r3 $r4 1)
	hex (0 2 10 8 1 3 11 9)			($N1 $N4 $Nz) simpleGrading ($r1 $r4 1)
);
 
edges 
(
    //Define these
    
    //To define a circular edge the syntax is:
    
    //arc p1 p2 (x y z) 
    //where p1 and p2 are start and end points of the curved edge and (x y z) is a coordinate
    //between points p1 and p2 from which the curve goes thrgouh
	
	arc 10 26	($negativeBigR 0 $z0)
	arc 11 27	($negativeBigR 0 $z1)
	arc 16 20	($negativeR 0 $z0)
	arc 17 21	($negativeR 0 $z1)
	
	arc 20 22	(0 $R $z0)
	arc 21 23	(0 $R $z1)
	arc 26 28	(0 $bigR $z0)
	arc 27 29	(0 $bigR $z1)
	
	arc 18 22	($R 0 $z0)
	arc 19 23	($R 0 $z1)
	arc 12 28	($bigR 0 $z0)
	arc 13 29	($bigR 0 $z1)
	
	arc 16 18	(0 $negativeR $z0)
	arc 17 19	(0 $negativeR $z1)
	arc 10 12	(0 $negativeBigR $z0)
	arc 11 13	(0 $negativeBigR $z1)
);

boundary
(
    //define the patches
    inlet
    {
        type patch;
        faces
        (
			(0 1 9 8)
			(8 9 25 24)
			(24 25 33 32)
			
        );
    }
    outlet
    {
        type patch;
        faces
        (
			(7 6 14 15)
			(15 14 30 31)
			(31 30 38 39)
        );
    }
    symmTop
    {
        type symmetryPlane;
        faces
        (
			(39 38 36 37)
			(37 36 34 35)
			(35 34 32 33)
        );
    }
	
    symmBottom
    {
        type symmetryPlane;
        faces
        (
			(6 7 5 4)
			(4 5 3 2)
			(2 3 1 0)
        );
    }
	
	cylinder
	{
		type wall;
		faces
		(
			(16 20 21 17)
			(20 22 23 21)
			(18 19 23 22)
			(16 17 19 18)
		);
	}

    frontAndBack
    {
        type empty;
        faces
        (
			(1 3 11 9)
			(3 5 13 11)
			(5 7 15 13)
			(6 4 12 14)
			(4 2 10 12)
			(2 0 8 10)
			
			(25 27 35 33)
			(27 29 37 35)
			(29 31 39 37)
			(26 24 32 34)
			(28 26 34 36)
			(30 28 36 38)
			
			(9 11 27 25)
			(10 8 24 26)
			(13 15 31 29)
			(14 12 28 30)
			
			(11 17 21 27)
			(16 10 26 20)
			
			(21 23 29 27)
			(22 20 26 28)
			
			(19 13 29 23)
			(12 18 22 28)
			
			(11 13 19 17)
			(12 10 16 18)
			

        );
    }

    
);
 
mergePatchPairs 
(
);

