5.VonKarmenVortexStreet/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  11
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

6
(
    inlet
    {
        type            patch;
        nFaces          102;
        startFace       77664;
    }
    outlet
    {
        type            patch;
        nFaces          139;
        startFace       77766;
    }
    symmTop
    {
        type            symmetryPlane;
        inGroups        List<word> 1(symmetryPlane);
        nFaces          173;
        startFace       77905;
    }
    symmBottom
    {
        type            symmetryPlane;
        inGroups        List<word> 1(symmetryPlane);
        nFaces          173;
        startFace       78078;
    }
    cylinder
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          197;
        startFace       78251;
    }
    frontAndBack
    {
        type            empty;
        inGroups        List<word> 1(empty);
        nFaces          78056;
        startFace       78448;
    }
)

// ************************************************************************* //
