5.VonKarmenVortexStreet/0/U
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  11
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volVectorField;
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

initialU		0.6;

//internalField   uniform ($initialU 0 0);
internalField   uniform (0 0 0);

boundaryField
{
    inlet
    {
        type            fixedValue;
        value           uniform ($initialU 0 0);
    }

    outlet
    {
        type            zeroGradient;
    }

    symmTop
    {
        type            symmetryPlane;
    }
	
	symmBottom
	{
		type			symmetryPlane;
	}
	
	cylinder
	{
		type			noSlip;
	}
	frontAndBack
	{
		type			empty;
	}
}

// ************************************************************************* //

