5.VonKarmenVortexStreet/system/fvSchemes
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  11
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSchemes;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

ddtSchemes
{
    default         backward; // changed Euler to backward, it could also be steadyState
}

gradSchemes
{
    default         Gauss linear;		// it could also be leastSquares
}

divSchemes
{
    default         none;
    div(phi,U)      Gauss linear; // changed from "limitedLinearV 1" to linear
	/////////// should also use Gauss upwind;;	///////////
    div((nuEff*dev2(T(grad(U))))) Gauss linear;  // deleted a lot of lines
}

laplacianSchemes
{
    default         Gauss linear corrected; 	// it could be "Gauss linear limited 1"
}

interpolationSchemes
{
    default         linear;
}

snGradSchemes
{
    default         corrected;
}


// ************************************************************************* //
